[
  {
    "url": "https://handbook.gitlab.com/handbook/",
    "title": "The Handbook | The GitLab Handbook",
    "content": "The Handbook Introduction The GitLab team handbook is the central repository for how we run the company. Printed, it consists of over 2,000 pages of text. As part of our value of being transparent the handbook is open to the world, and we welcome feedback. Please make a merge request to suggest improvements or add clarifications. Please use issues to ask questions. For a very specific set of internal information we also maintain an Internal Handbook Handbook Contents Company Company About GitLab History Values Mission Vision Strategy Communication YouTube Zoom Webinars Culture All-Remote Life at GitLab GitLab Contribute Team Only healthy constraints TeamOps CEO Readme CEO Shadow Program Cadence E-Group Offsite KPIs OKRs Pricing Model Office of the CEO Group Conversations E-Group Weekly Environmental, Social, and Governance Handbook Handbook About the Handbook Handbook Changelog Handbook Escalation Handbook Usage Contribution Guide Editing the handbook Handbook Style Guide Handbook maintenance People Group People Group Anti-Harassment Policy Global Volunteer Month Hiring Greenhouse Interviewing Jobs FAQ Inclusion & Diversity Ally Resources Gender and Sexual Orientation Identity Definitions and FAQ Unconscious Bias Labor and Employment Notices Leadership Learning & Development Onboarding Offboarding Spending Company Money Travel Visas Talent Assessment Team Member Relations Philosophy Total Rewards Benefits Incentives Paid time off Compensation Equity Compensation Tools and Tips Searching the GitLab Website Like a Pro Engineering Engineering Customer Support Department Development Department Dev Sub-department Fulfillment Sub-department Ops Sub-department Software Supply Chain Security Sub-department Secure Sub-department Infrastructure Department Developer Experience Engineering Productivity Security Practices Open Source Security Security Security Standards Product Security Security Operations Threat Management Security Assurance Marketing Marketing Team Member Social Media Policy Blog Brand and Product Marketing Brand Merchandise Handling (Swag) Product and Solution Marketing Demos Core Product Marketing Competitive intelligence Customer Advocacy Design Content Enterprise Data Integrated Marketing Field Marketing Channel & Alliances Marketing Corporate Events Account Based Marketing Campaigns Lifecycle Marketing Digital Strategy Digital Experience Sales Development Marketing Operations and Analytics Marketing Operations Marketing Strategy & Analytics Growth Developer Relations Community Programs Developer Advocacy Contributor Success Corporate Communications Analyst Relations Speaking Resources Incident Communications Plan Sales Sales Alliances Commercial Customer Success Customer Success Management Reseller Channels Field Operations Sales Operations Deal Desk Data Intelligence Field Enablement Sales Strategy Sales Systems Reporting Solutions Architecture Finance Finance Accounts Payable Accounts Receivable Business Technology Expenses Financial Planning & Analysis Payroll Procurement Tax Board meetings Internal Audit Sarbanes-Oxley (SOX) Compliance Equity Compensation Product Product Release posts About the GitLab Product Being a Product Manager at GitLab Product Principles Product Processes Product sections, stages, groups, and categories Product Development Flow Product Development Timeline Data for Product Managers Product Pricing Model Corporate Development / Acquisitions UX Department Technical Writing UX Research Product Design Legal and Corporate Affairs Legal and Corporate Affairs Commercial Corporate Corporate Development Employment Environment, Social, and Governance (ESG) Operations Privacy Product Risk Management and Dispute Resolution Trade Compliance Take GitLab for a spin See what your team could do with The DevSecOps Platform. Get free trial Have a question? We're here to help. Talk to an Expert Last modified April 10, 2025: Fix broken links (7fbeab40) View page source - Edit this page - please contribute.",
    "hash": "0b806b77bb2d4e3e8fbd374eaa7206fd"
  },
  {
    "url": "https://handbook.gitlab.com/handbook/company/",
    "title": "About GitLab | The GitLab Handbook",
    "content": "About GitLab AMAs What you need to know about Ask Me Anything (AMA) Approach to OKRs at GitLab An overview of how OKRs are done at GitLab. Being a public company GitLab as a Public Company In 2017, GitLab established aspirational milestones for a public … Cadence Everything in a company happens in a certain cadence. The period of each cadence differs. Learn about the cadences we have at GitLab. E-Group offsite The E-Group offsite happens every quarter for four days after the Board of Directors meeting E-Group Weekly For executives to connect on a weekly basis in order to get timely input from E-Group, align on key initiatives, inform about key business happenings and celebrate company successes. Family and Friends Day At GitLab, Family & Friends days are shared days away from work to prioritize time with family and friends, volunteering, self-care, or anything else. GitLab All-Company Meetings An overview of GitLab Assembly and Quarterly Kickoff Meetings GitLab Culture Here's a look at what you can expect from our culture and all-remote environment. GitLab Environmental, Social, and Governance (ESG) An overview of corporate sustainability at GitLab. GitLab licensing technology to independent Chinese company FAQ On this page you can view frequently asked questions about GitLab licensing its technology to a new, independent Chinese company. GitLab Mission We at GitLab believe that all digital products should be open to contributions; from legal documents to movie scripts, and from websites to chip designs. GitLab Purpose GitLab empowers everyone through knowledge sharing, job access, and our software platform. GitLab Strategy GitLab has a 3 year strategy to be the leading complete DevSecOps platform delivered as a single application. GitLab Vision Behind the scenes of The DevSecOps Platform Group Conversations Everything you need to know about GitLab's daily, recurring Group Conversations History of GitLab Review a summarised history of GitLab and the adventure so far from 2011 up until the present day. Learn more here! Infrastructure Standards This handbook section defines the latest iteration of infrastructure standards for AWS and GCP across all departments and groups at GitLab. Inspired by GitLab Which companies can be listed here? Any company that has been inspired by GitLab’s culture … KPIs What are KPIs Every part of GitLab has Key Performance Indicators (KPIs) linked to the company OKRs. … Meet Our Team More than 3,000 people have contributed to GitLab. The GitLab Inc. team consists of the following … Only Healthy Constraints Companies often slow down as they mature. GitLab strives for healthy constraints. Organizational Structure GitLab has at most eight layers in the company structure (Associate/Intermediate/Senior, Manager/Staff, Senior Manager/Principal, Director/Distinguished, Senior Director, VP/Fellow, Executives, Board). View more here! Our stewardship of GitLab GitLab has an open core business model and generate almost all our revenue with subscriptions to paid tiers. Learn more! Pricing model Most GitLab functionality is and will be available for free in our Free tier. Paid tiers include features targeted for managers, directors, and executives. Quote to Cash GitLab's Quote to Cash systems and processes Still a Startup GitLab elevates others through knowledge sharing, job access, and our software platform. Working Groups Like all groups at GitLab, a working group is an arrangement of people from different functions. Learn more! Last modified September 1, 2023: Add comment to vision doc to signpost to buyer exp. (25772a09) View page source - Edit this page - please contribute.",
    "hash": "a79cfbd2a77d2d636cb4a3a481d96a4d"
  },
  {
    "url": "https://handbook.gitlab.com/handbook/engineering/",
    "title": "Engineering | The GitLab Handbook",
    "content": "Engineering The GitLab Product team looks ahead for expanding the platform “What\" (customer needs) and “Why” (business strategy) and Engineering determines the “How” (technical implementation) and “When” (scheduling) of the platform releases. The content on this page talks about how we do engineering at GitLab. Engineering Direction GitLab has a Three-Year Strategy, and we’re excited to see every member of the Engineering division contribute to achieving it. Whether you’re creating something new or improving something that already exists, we want you to feel empowered to bring your best ideas for influencing the product direction through improved scalability, usability, resilience, and system architectures. And when you feel like you need to expand your knowledge in a particular area, know that you’re supported in having the resources to learn and improve your skills. Our focus is to make sure that GitLab is enterprise grade in all its abilities and to support the AI efforts required to successfully launch AI features to General Availability. Making sure that GitLab is enterprise grade involves several teams collaborating on improving our disaster recovery and support offerings through ongoing work with GitLab Dedicated and Cells infrastructure. Our goal here is improved availability and service recovery. Engineering Culture Engineering culture at GitLab encompasses the processes, workflows, principles and priorities that all stem from our GitLab Values. All these things continuously strengthen our engineering craftsmanship and allow engineers to achieve engineering excellence, while growing and having a significant, positive impact on the product, people, and the company as a whole. Our engineering culture is primarily being carried and evolves through knowledge sharing and collaboration. Everyone can be part of this process because at GitLab everyone can contribute. Engineering Excellence Engineering excellence can be defined as an intrinsic motivation to improve engineering efficiency, software quality, and deliver better results while building software products. Engineering excellence is being fueled by a strong engineering culture combined with a mission: to build better software that allows everyone to contribute. Engineering Initiatives Engineering is the primary advocate for the performance, availability, and security of the GitLab project. Product Management prioritizes 60% of engineering time, so everyone in the engineering function should participate in the Product Management prioritization process to ensure that our project stays ahead in these areas. Engineering prioritizes 40% of time on initiatives that improve the product, underlying platform, and foundational technologies we use. Work in the 40% time budget should be coordinated and prioritized by the Engineering Manager of a team. Use the label Engineering Time for issues and MRs that are done as part of it so we can follow the work and the results across the engineering division. Contributing to broad engineering initiatives and participating in working group-related tasks. Review fixes from our support team. These merge requests are tagged with the Support Team Contributions label. You can filter on open MRs. Working on high priority issues as a result of issue triaging. This is our commitment to the community and we need to include some capacity to review MRs or work on defects raised by the community. Improvements to the performance, stability and scalability of a feature or dependency including underlying infrastructure. Again, the Product team should be involved in the definition of these issues but Engineering may lead here by planning, prioritizing, and coordinating the recommended improvements. Improvements and upgrades to our toolchain in order to boost efficiency. Codebase improvements: Removing technical debt, updating or replacing outdated dependencies, and enhancing logging and monitoring capabilities. Constructing Proof-of-Concept models for thorough exploration of new technologies, enhancements and new possibilites. Work on improvements and feature enhancements to the product, in the sense of internal community contributions, that would increase our internal engineering productivity by focusing on ready-to-go items that are currently assigned a low priority in the backlog. Engineering Innovation Engineering Innovation is a new process geared toward individual or small-team collaboration that encourages engineers to explore new ideas and Proof-of-Concepts. These projects are typically lean, time-boxed, iterative, and designed to validate whether an idea has the potential to evolve into a viable experimental feature or product. See the Innovation at GitLab Guide. Technical Roadmaps Some of the above examples for the 40% time budget can help in forming a long-term technical roadmap for your group, and determine how best to prioritize your technical work to support overall business goals. In addition to the examples above: Ask ...",
    "hash": "3962745861916c12bda9b133e48ba2b4"
  },
  {
    "url": "https://handbook.gitlab.com/handbook/product/",
    "title": "Product Handbook | The GitLab Handbook",
    "content": "Product Handbook Most of the content in the product handbook talks about how we do product at GitLab. Welcome to the Product Team Handbook The Product Team is led by David DeSanto. The Product Handbook focuses on how we do product at GitLab. Please see Product Direction to learn about what the Product Team plans to build. Product Team Functions Product Management User Experience Product Technical Program Management Product Team Mission We create products and experiences that customers love and value. Consistency wins as you scale. Our organizational goal is to create a Product Manager (PM) system that maximizes the chances of success across new products, new features, and new team members. We are shipping an experience, and not just a product. Don’t forget about the links between the product and the website, pricing & packaging, documentation, sales, support, etc. It’s about our customers and doing a job for them, not the product itself. Think externally about customer problems, not internally about the technology. It’s about love AND value. Will customers value what we are building? We need to make sure what we build helps build and extract customer value. Contributing to the Product Handbook The product handbook is widely referenced by product managers and cross-functional team members. Therefore, we want to follow a consistent change management process so all affected collaborators are aligned and informed when there are changes (specially new requirements, processes, meetings, etc.) that affect their workflow. It is helpful to indicate which type of change you are suggesting: Small improvement (typos, clarifications, etc.) Adding a new section Modifying existing section Documenting a new process Adding a new page or directory Other For a small improvement, please feel free to merge the MR yourself. Otherwise, please tag the appropriate code owner for review and approval. The guidance below should be followed for driving awareness: Informing team members about the changes It is your responsibility to communicate with relevant team members about your merge request. Here are some best practices to follow: For significant changes affecting the whole Product or Engineering team, consult your manager or product leader for the best communication strategy. For changes specific to product management, tag @gl-product-pm in the merge request before merging. Indicate in the comment whether you are requesting contributions and feedback or simply providing information. For changes relevant to other teams, tag department leads such as the VP of UX, VP of Development, or the Director of Quality Engineering in the merge request before merging. Share and cross-post the merge request link with a brief description in relevant channels such as Slack #product, #product-leadership, #eng-managers, and #ux-managers. For more guidance on communication, refer to the GitLab Communication tips and best practices. Product Management If you’d like to collaborate with product management see How to Engage guide. Product Principles The Product Principles section is where you can learn about our strategy and philosophy regarding product development here at GitLab. Product Processes For a detailed view on how we do Product Development, read up on our established Product Processes. Product sections, stages, groups, and categories To learn how the GitLab product and our Teams are organized review our Product Categorization section. About the GitLab Product Learn about GitLab as a product, including what does it mean to be a single application, our subscription tiers and pricing model, and the basics of permissions in the platform. Product Manager Responsibilities Understand the roles and responsibilities of product managers. Being a Product Manager at GitLab Want to know more on what being a Product Manager at GitLab is like? Checkout our Product Management guide for helpful information like our Career Development Framework and learning/development resources. Product Performance Indicators Learn how we measure success in Product via our Product KPIs, which are tracked in our Product project. For best practices and guidance on how to add instrumentation for features please review our Analytics Instrumentation workflow. Product OKRs Understand the OKR Process for the GitLab Product Team and review current and past OKRs. Our Product Leadership Team Learn about our Product Leadership Team and learn about them via their personal README’s. Communicating with the Product Division Below are team emails and handles that can be used for different departments and sub-departments in the Product Division. These groups are used for internal communication and the @mention can only be used by project members. Please remember that tagging @mention on issues will generate in-product to-do items and email notifications to all team members in that project, so use it only when you need to communicate with the entire team. For communication specifically for prod...",
    "hash": "a42b732322dd26a875ec051e643b0ec7"
  },
  {
    "url": "https://handbook.gitlab.com/handbook/marketing/",
    "title": "Marketing | The GitLab Handbook",
    "content": "Marketing GitLab Marketing Handbook: Brand and Product Marketing, Integrated Marketing, Sales Development, Marketing Strategy and Platforms, Enterprise Data, Developer Relations, and Corporate Communications Welcome to the GitLab Marketing Handbook The GitLab Marketing team operates as one team and is organized by the following departments: Integrated Marketing, Brand and Product Marketing, Marketing Operations and Analytics, Sales Development, Enterprise Data, Corporate Communications, and Developer Relations. This page documents our shared team philosophy and processes, while the individual department handbooks contain more detailed information. Marketing Purpose GitLab is the leading DevSecOps Platform that empowers organizations to deliver quality software faster and more efficiently while strengthening security and compliance. The marketing team’s purpose is to amplify the value of the GitLab platform, authentically and transparently, by putting customers and the community at the center of everything we do. Marketing Alignment As the GitLab Marketing team puts customers at the center of everything we do, the marketing strategy aligns with the customer journey. The journey’s purpose is to provide a clear and cohesive experience to a prospect/customer from the minute they become Aware of GitLab, to Considering the platform and Converting into a happy customer, and then of course Expanding over time and becoming an Evangelist. Each stage has a purpose which is the guiding indicator for the marketing team to measure our success. Everything the team plans and executes in the short and long term will revolve around the customer journey, and we will also measure our success along each step to hold ourselves accountable. Marketing Strategy Our FY25 Marketing Strategy and Plan can be found in the internal handbook. Marketing OKRs Each quarter, the Marketing team creates OKRs (Objectives and Key Results) that cascade from the CEO’s OKRs. Each department within the Marketing team manages their own cascading OKRs. Team members can access the filtered OKR search. How we work Value-driven Marketing Team How we work as one team aligns with the GitLab Values. Results - The team measures success together along the customer journey. Each quarter, we align CMO OKRs based on company goals set in the company OKRs. This helps us stay aligned with company-level goals while also understanding if what we are doing quarter over quarter is moving the needle on our marquee metrics along the customer journey. Being data-driven as a team is essential for team success. Iteration - Like the rest of the company, we aspire to be agile and experimental where possible. In every area possible, we roll out campaigns, brand updates, messaging, etc. in small iterations, measure the success, and take next steps accordingly. Transparency - We strive to be as transparent as possible in all areas of marketing. We welcome thoughts and feedback from each other, other GitLab team members, and the community at all times. Collaboration - A major key to success is operating as one team. Leveraging the different backgrounds, cultures and, skill sets of an entire company and community, the marketing team operates in a way where everyone can contribute. Collaboration is key to taking Marketing to the next level. Diversity, Inclusion and Belonging (DIB) - With GitLab team members being located across the world, we strive to always keep DIB at the core of everything we do. Like the rest of GitLab, we follow asynchronous meeting principles, welcome diverse perspectives, and as marketers, foster an environment where quirkiness is welcomed. Efficiency - We keep efficiency at the forefront of everything we do. Whether it is bringing in marketing technology to automate menial tasks and foster collaboration, finding ways to save cost, or simply doing the right things to be respectful of others’ time, efficiency drives faster results for marketing. Team Meeting Cadence Monthly Marketing All Hands (All Marketing team members) Goal: Align all Marketing team members on activities in progress to achieve our goals, and update the team on cross-functional items. The meeting is 50 minutes and runs as follows: Always begin by welcoming our newest GitLab Marketing Team Members Celebrate well-deserved promotions CMO Top of Mind (5 items per month) ~20 minutes of CMO Leadership sharing updates ~20 of either marketing team member updates (to be added during the call for items announcement prior) or special guest from another GitLab org The remaining time for Q&A and most importantly…recognition! All team members are encouraged to bring forward discussion topics that they want to share with the team or to have covered during the call. Quarterly CMO Q&A (one session for each department) Goal: Provide the team a smaller forum to ask any questions they may have, offer feedback, and brainstorm ideas directly with the CMO Weekly CMO Leadership Direct Reports Team Meetings (Each ma...",
    "hash": "61eb5df8521b0f71aab716f81ea27b4d"
  },
  {
    "url": "https://handbook.gitlab.com/handbook/sales/",
    "title": "Sales | The GitLab Handbook",
    "content": "Sales The GitLab Field team includes multiple functions: Enterprise Sales, Commercial Sales, Customer Success, Channel Partners, Alliances, Field Operations Welcome to the Sales team homepage The GitLab Field team includes multiple functions: Enterprise Sales, Commercial Sales, Customer Success, Channel Partners, Alliances, Field Operations. This page serves as our home base. From here, you can find a wealth of resources from all of the teams in our department. Interested in collaborating with the Sales team? See our How We Work and Communicating with the Team sections. Want to learn more about our goals? Check out our most recent Objectives and Key Results (OKRs). Quick Reference Guide Where to Begin Field Enablement Resources Sales Processes & Standard Operating Procedures Sales Meetings & Events Sales & Customer Success Onboarding Sales Training Sales Order Processing President’s Club Commercial Sales Sales Enablement Sessions Engage & Educate the Customer Sales Kickoff Enterprise Sales Command of the Message Facilitate The Opportunity Sales Meetings Inside Sales Most Commonly Used Sales Resources Deal Closure Channels Field Certification Program Retain and Expand Sales Territories Sales Manager Best Practices Forecasting Sales Term Glossary Field Flash Newsletter Investor Sales Support ACV Deep Dive Field Team Recognition Programs Customer Planning ARR Deep Dive Highspot - GitLab Sales Asset Management Tool Rules of Engagement for Selling GitLab & Partner Professional Services Field Operations Teams and Resources Customer Success Resources Helpful Sales Handbook Tips Sales Resources Outside of the Sales Handbook —— —— —— —— Field Operations Customer Success Teams FAQ from Prospects Resellers Handbook Sales Operations How to Engage a Solutions Architect Client Use Cases Customer Reference Sheet Deal Desk Account Planning Template for Large Accounts Dealing with Security Questions From Prospects Customer Reference Case Study Dynamic Board Field Enablement How to Engage a CSM/CSE How to conduct an executive meeting GitLab Support Handbook Sales Strategy CEO Preferences when speaking w/ prospects/customers Sales Systems Best Practices for Building Value with Customers Commissions Understanding How Our Customers Use GitLab Customer Success Operations Prospect Engagement Best Practices Account Ownership Rules of Engagement Parent and Child Accounts Opportunity Stages Growth Resources (Finding Seat Count) Record Ownership Routing Rules Forecasting Definitions and Processes Data Intelligence Associating emails to Salesforce Early to Mid-Stage Late Stage Post Sales Processes Team Member & Manager Resources —— —— —— —— Opportunity Types Submitting an Opportunity for Approval How to Amend a Subscription Quote Leadership Handbook Opportunity Naming Conventions How to Handle Vendor Setup Forms How to Renew a Subscription Quote GitLab Values & Certification Process How to Create an Opportunity True Ups GitLab Competencies & Certification Process MEDDPPICC Qualification Contract Resets GitLab Diversity, Inclusion & Belonging Sales Discovery & Qualification Questions People Business Partner Alignment for Sales GitLab ROI calculator Proof of Value Creating a Quote Quote Approval Matrix Delivering a Quote via DocuSign Marketing Resources Strategic Marketing Product Resources —— —— —— —— Marketing Strategic Marketing Handbook Product Team Handbook Sales Development Handbook Product Marketing Manager Assignments Engaging Product Management GitLab Value Proposition Customer-Facing Presentations Asking Questions/Giving Feedback on a Feature Lead and Contact Statuses Print Collateral Product Categories Inbound Lead Generation Sales Collateral Google Drive Features by Group Finance Process Business Operations Process Legal Process —— —— —— —— Deal Desk: Assistance with Quotes Business Operations Handbook Collaborating with Legal - Sales Deal Desk: Approval Process Data Team Handbook Legal Page Sending a Quote to Zuora Data Quality Process Engaging Legal in Deals How to Initiate a Refund IT Ops Handbook Access Requests Who We Are The Sales team is led by the Chief Revenue Officer (CRO). Reporting into this individual are the: VP, Enterprise Sales VP, Commercial Sales (Mid-Market and SMB) VP, Field Operations VP, Customer Success VP, Global Channels VP, Alliances Chief of Staff, CRO The Sales team is organized into Large, Mid-Market, and SMB segments. (Descriptions of Sales segments can be found in the Field Operations Handbook - Segmentation section.) The people working with each segment and their quota are: Large: Strategic Account Executive (SAE) Mid-Market: Mid-Market Account Executive (MM AE) SMB: SMB Account Executive (SMB AE) How We Work The GitLab Sales team embodies our CREDIT values in every aspect of our work. Specifically, we constantly work to overperform and achieve strong results. We prioritize efficiency in our processes and operations. We succeed because of transparent, cross-functional collaboration. We are com...",
    "hash": "6f8dd6189f817bea02ead94ee3ac2506"
  },
  {
    "url": "https://handbook.gitlab.com/handbook/people-group/",
    "title": "People Group | The GitLab Handbook",
    "content": "People Group The People Group at GitLab supports all GitLab team members through the complete team member lifecycle. Welcome Welcome to the People Group handbook! You should be able to find answers to most of your questions here. People Group Vision The People Group works together to establish a high performance and results driven culture where a diverse and inclusive team can experience a meaningful career. We support a culture that enables people to do their best work and advance their careers while fully contributing to advancing GitLab’s business results. We hire, promote, and recognize team members who best live our values. The People Group strategy is to set the foundation for GitLab’s 3 year strategy through a focus on attracting and retaining diverse talent, creating a high performance culture with a focus on efficiency and quality results, driving divisional success through talent programs, and cultivating an equitable and inclusive culture. We’ve published more information about how this vision translates to strategy and OKRs for GitLab team members in this internal-only presentation. Connect with us You can also check out pages related to People Group in the section below. If you can not find what you are looking for please do the following: The People Group holds several subprojects to organize the people group; please create an issue in the appropriate subproject or general if you’re not sure. Please use confidential issues for topics that should only be visible to GitLab team-members. Similarly, if your question can be shared please use a public issue. Tag @gl-people-connect-team or @gl-hiring so the appropriate team members can follow up. Please note that not all People Group projects can be shared in an issue due to confidentiality. When we cannot be completely transparent, we will share what we can in the issue description, and explain why. Employment Issue Tracker: Only Onboarding, Offboarding and Transition Issue Templates are held in this subproject, and they are created by the People Connect Team only. Interview Training Issues, are held in the Training project and created by the Talent Acquisition team. Please see the interviewing page for more info. People Connect; Please create a case for the People Connect team with any questions that do not seem appropriate for the issue tracker within HelpLab - choosing the applicable template/category applicable. For access requests regarding Google or Slack groups, please create an issue here: https://gitlab.com/gitlab-com/team-member-epics/access-requests. For questions that relate to Payroll, Expenses or Equity, please direct your question to the respective teams in HelpLab. Regarding questions for our recruiting team, including questions relating to access, or anything to do with Greenhouse, referrals, interviewing, or interview training please use the #talent-acquisition channel. If you need to discuss something that is confidential/private (including sensitive matters surrounding your team), you can open a HelpLab Case the Team Member Relations team. Any team member, regardless of location, can use this form to discuss a private sensitive matter. If you need help with any technical items, for example, 2FA, please ask in #it_help. The channel topic explains how to create an issue. For urgent matters you can mention @it-ops-team. The People Group: One Team Mosaic Video One Team Mosaic Video In general, the People Group is here to support GitLab’s mission by bringing top talent into GitLab, and then enabling team members to make meaningful contributions in alignment with our values.  Please don’t hesitate to reach out with questions or ask for support! The People Group works together as one team, made up of five departments: People Operations, Talent and Engagement, Total Rewards, People Business Partners, and Diversity, Inclusion, and Belonging (DIB). Department Teams People Operations People Connect, Employment Solutions, People Compliance, People Tools & Technology, People Analytics, Team Member Relations Talent and Engagement Talent Acquisition; Candidate Experience, Talent Acquisition Operations and Insights, Sourcing, Talent BrandEngagement; Talent Development, Engagement, Talent Management Total Rewards Global Compensation, Benefits, and Equity Strategy People Business Partners Aligned to Engineering, Product, Sales, Marketing, and G&A DIB Need Help? In Case of Emergency If team members need emergency support from GitLab’s People team, please create a case in HelpLab. HelpLab is monitored during most working hours and is the centralized support platform for all people-related queries. Read more about our People Connect methods of engagement. In critical cases, the VP, People Operations, Technology & Analytics is contactable 24/7 via their mobile numbers that appear in their Slack profile. We trust team members to always use their best judgement when facing any emergency. Team members are encouraged to dial their country’s emergency serv...",
    "hash": "92bb4fd20a5f421348b25cb409ec0b8e"
  },
  {
    "url": "https://handbook.gitlab.com/handbook/finance/",
    "title": "Finance | The GitLab Handbook",
    "content": "Finance Welcome to the GitLab Finance Handbook The GitLab Finance Department includes multiple Teams: Accounting, Financial Planning & Analysis, Tax and Business Operations Programs. Quick Links Finance Issues Please use confidential issues for topics that should only be visible to team members at GitLab. Accounts Payable Expense Guidelines Operating Metrics Procurement Sales Comp Plan Signature Authorization Matrix Authorization Matrix Policy Stock Options Forms 2025 GitLab Inc W-9 Document and Certificate of Residence Form CA-590 - Please request by email to tax@gitlab.com Correspondence Please use the #finance chat channel in Slack for questions that don’t seem appropriate for the issue tracker or internal email correspondence. Accounts Payable- inquiries which relate to vendor and merchant invoices, or team member’s expenses should be sent to our Accounts Payable mailbox - ap@gitlab.com. You can also reach the AP team on Slack in the #accountspayable or #expense-reporting-inquiries chat channels. Invoices that require payment processing should be sent to ap@gitlab.com. Billing Operations- customer billing inquiries should be sent to our Billing mailbox – billing@gitlab.com. Accounts Receivable - customer payment/remittance inquiries should be sent to our Accounts Receivable mailbox - AR@gitlab.com Payroll- inquiries which relate to contractor invoices should be sent to our Payroll mailbox - nonuspayroll@gitlab.com. CFO Approvals Please use the #cfo-approvals chat channel in Slack for alerting the CFO to a request for his approval Tag the CFO’s Staff EBA in the Slack request for visibility and followup Appropriate Finance team members in the approval flow must approve prior to requesting CFO approval All requests must go through the appropriate approvals process, include a link to the Issue or description and receive all approvals prior to requesting CFO approval We Finance Finance Handbooks Accounting Business Technology Financial Planning & Analysis Investor Relations Tax General Topics Legal and Financial Information For commonly requested company information, please visit our wiki page. Company Accounts Login information for the following accounts can be found in the Secretarial vault on 1Password: FedEx Amazon IND (Immigratie en Naturalisatie Dienst, in the Netherlands) company number If you need this information but cannot find it in your shared vaults, check with the People Connect Team members to get access. Fiscal Year A fiscal year is a one-year period that corporations use for accounting and budgeting. GitLab’s Fiscal Year runs from February 1 to January 31. The fiscal year naming correlates to the ending month of the given fiscal year, for example FY26 is GitLab’s fiscal year running February 1, 2025 to January 31, 2026. Q1: February 1 through April 30 Q2: May 1 through July 31 Q3: August 1 through October 31 Q4: November 1 through January 31 Fiscal Year Calendar Year FY26-Q1 2025-02-01 to 2025-04-30 FY26-Q2 2025-05-01 to 2025-07-31 FY26-Q3 2025-08-01 to 2025-10-31 FY26-Q4 2025-11-01 to 2026-01-31 Refer to our writing style guidelines for proper use of date formats. Revenue non-committee Internal Management Members: Chief Financial Officer (DRI), Chief Executive Officer, Chief Revenue Officer (model, guidance, plan, target) Invoice template and where to send Vendor invoices are to be sent to ap@gitlab.com and payroll@gitlab.com for contractors. An invoice template can be found in Google Docs by the name of “Invoice Template”. Non-US contractors not from Hungary, Italy, Japan, New Zealand, Nigeria, South Africa, Switzerland, and Ukraine will get pay their monthly wages and expenses through iiPay. Here is the process: enter bank information in Workday under Bank Information tab. Note - new contractor should enter their bank information within 3 business days from their start date. enter VAT number if it is available submit monthly salary/bonus/commission invoice in through Google form by the 8th of each month (as described to you during onboarding) submit expenses through Navan Expense by the 8th of each month the scheduled payment date is the 22nd of each month iiPay will send out remittance advice along with the scheduled payment via your GitLab email address Non-US contractors from Italy, Nigeria, South Africa, Switzerland, and Ukraine will need to send their monthly invoice for salary/bonus/commission and any expenses by the 15th to payroll@gitlab.com. In many cases, VAT will not be payable on transactions between GitLab BV and EU-based vendors/contractors, thanks to “Shifted VAT”. To make use of this shifted VAT: The vendor/contractor writes the phrase “VAT shifted to recipient according to article 44 and 196 of the European VAT Directive” on the invoice along with the VAT-number of GitLab IT BV (NL860316828B01). On the vendor’s VAT return the revenue from GitLab BV goes to the rubric “Revenue within the EU”. It goes without saying that vendors are responsible for their own correct and tim...",
    "hash": "a3e5a344a8773e19c44f6a73ac7a4895"
  },
  {
    "url": "https://handbook.gitlab.com/handbook/legal/",
    "title": "Legal & Corporate Affairs (\"LACA\") | The GitLab Handbook",
    "content": "Legal & Corporate Affairs (\"LACA\") Our Mission We leverage our versatile skill sets to drive positive outcomes for GitLab and our customers. Approachable and collaborative, LACA team members are trusted thought partners to our colleagues across GitLab, and facilitate efficient and informed decision making in all areas of the business. In short: LACA – We’re your one phone call. Legal & Corporate Affairs Functional Groups Commercial The GitLab Legal Commercial team is responsible for all contracting matters at GitLab, including procurement, revenue, channel, technical, and alliances, while partnering with sales, technical, and business stakeholders to ensure alignment with GitLab contracting standards and efficient execution timelines. The team supports GitLab’s go-to-market and procurement functions, providing knowledge and creativity in advising on contractual and regulatory matters to facilitate customer-centric results in accordance with the Company’s values. Helpful links: Sales Guide | Collaborating with GitLab Legal Commercial Legal Internal Handbook Highspot - GitLab Legal Hub Corporate & Compliance The Corporate & Compliance group drives strategic results for GitLab via cross-functional relationships to support a climate of principled corporate governance and the company’s culture of compliance. Corporate Development The Corporate Development group conducts diligent and thorough analysis to strategically identify, evaluate and execute potential acquisitions to accelerate the product roadmap and advance the company’s competitive position in the market. Employment The Legal Employment team serves as a strategic partner across the organization, providing expert guidance and proactive legal solutions throughout the entire team member lifecycle. Environment, Social, and Governance (ESG) The ESG group works cross-functionally to integrate ESG considerations, ESG regulatory compliance, and responsible business practices as part of GitLab’s overarching mission to make our customers successful. Privacy, Product, and Intellectual Property The Privacy and Product and Intellectual Property group enables fast-paced product development within applicable regulatory confines; privacy solutions so customers can confidently co-create in those products; and robust protection of Company IP. Risk Management and Dispute Resolution The Risk Management and Dispute Resolution group directs GitLab’s unified, transparent and ethical approach to defending company interests while resolving disputes should they arise. Strategy and Legal Operations The Strategy and Legal Operations group promotes continued process improvement such that LACA may be efficient and effective in its performance, including procurement of the most suitable tools and technology. How to Reach Us For quick questions that do not require legal advice, deliverables, or any discussion of confidential information, you can reach out to LACA in Slack at #legal. We find this channel best for questions about process, who handles what, or how to find certain things if the handbook has not yielded the right result for you after searching. #legal is not a private channel, so your inquiry will be visible to the entire company. One of our team members will do their best to answer your question in a timely fashion. Most questions regarding specific customers require a legal case in Salesforce. Follow the process here to open one. For other questions related to deliverables and non-sensitive information, create an issue in the Legal and Compliance project. Be sure to use the template most suited to your request to engage the right team members. For sensitive, private, or confidential matters, email legal_internal@gitlab.com. Anonymous Internal Ethics and Compliance Reporting We take employee concerns very seriously and encourage all GitLab team members to report any ethics and/or compliance violations by using EthicsPoint. Further details can be found in the People Group Handbook under How to Report Violations and in our Code of Business Conduct and Ethics. GitLab Policies See GitLab’s Ethics and Compliance Program for a list of policies, compliance standards, guidelines, and other resources. Authorization Matrix The Authorization Matrix designates who is authorized to sign legal documents. Only GitLab team members with signature authority can execute agreements on behalf of GitLab. Non-Disclosure Agreements Follow the non-disclosure agreement process to learn how to send an NDA (note there’s a separate process for non-standard NDAs). NAVEX Compliance Courses For information about compliance training, including new hire requirements, and tips for using the NAVEXEngage platform, see here. Freedom of Information Act (FOIA) Requests What is a Freedom of Information Act (FOIA) request? The Freedom of Information Act (FOIA) provides public access to all United States federal agency records except for those records (or portions of those records) that are protected from disclosu...",
    "hash": "1d3982f0a9d21ea2b54c812d4ae57276"
  },
  {
    "url": "https://handbook.gitlab.com/handbook/security/",
    "title": "Security at GitLab | The GitLab Handbook",
    "content": "Security at GitLab Security Vision and Mission Our vision is to transparently lead the world to secure outcomes. Our mission is to enable everyone to innovate and succeed on a safe, secure, and trusted DevSecOps platform. This will be achieved through 5 security operating principles: Accelerate business success with a focus on: Prioritize ‘boring’, iterative solutions that minimize risk Find ways to say Yes Understand goals before recommending solutions Use GitLab first Efficient operations with a focus on: Technical controls over handbook rules Leverage automation first (robots over humans) Responsible decisions (Spending, Tooling, Staffing, etc) over low ROI (return on investment) decisions Reusable or repeatable over singular solutions Transparency with a focus on: Responsible protection of MNPI (material non-public information) Evangelize dogfooding of GitLab publicly Lead with metrics Balance security with usefulness Risk Reduction with a focus on: Secure by default Preventative controls over detective controls Solving root causes over treating symptoms Visibility through Coverage, Discoverability, Observability Collaborative Culture with a focus on: Working together on common solutions Solve shared problems with shared solutions Simplifying language for everyone to understand Avoiding security jargon Seek opportunities to help others succeed To help achieve the vision of transparently leading the world to secure outcomes, the Security Division has nominated a Security Culture Committee. Division Structure The Security Division provides essential security operational services, is directly engaged in the development and release processes, and offers consultative and advisory services to better enable the business to function while minimising risk. To reflect this, we have structured the Security Division around four key tenets, which drive the structure and the activities of our group. These are : Product Security Security Operations Corporate Security Security Assurance Application Security Infrastructure Security Security Platforms and Architecture Vulnerability Management Data Security Security Logging Security Incident Response Team (SIRT) Trust and Safety Red Team Threat Intelligence Signals Engineering Corporate Security Helpdesk Support Tech Stack Systems Engineering Teams Field Security Security Compliance Security Governance Security Risk Secure the Product - The Product Security Department The Product Security Department is primarily focused on Securing the Product. This reflects the Security Division’s current efforts to be involved in the Application development and Release cycle for Security Releases, Infrastructure Security, and our HackerOne bug bounty program. The term “Product” is interpreted broadly and includes the GitLab application itself and all other integrations and code that is developed internally to support the GitLab application for the multi-tenant SaaS. Our responsibility is to ensure all aspects of GitLab that are exposed to customers or that host customer data are held to the highest security standards, and to be proactive and responsive to ensure world-class security in anything GitLab offers. Protect the Company - The Security Operations Department Security Operations Department teams are primarily focused on protecting GitLab the business and GitLab’s platform. This encompasses protecting company property as well as to prevent, detect and respond to risks and events targeting the business and our platform. This department includes the Security Incident Response Team (SIRT) and the Trust and Safety team. These functions have the responsibility of shoring up and maintaining the security posture of GitLab’s platform to ensure enterprise-level security is in place to protect our new and existing customers. Lead with Data - The Threat Management Department Threat Management Department teams are cross-functional. They are responsible for collaborating across the Security Division to identify, communicate, and remediate threats or vulnerabilities that may impact GitLab, our Team Members or our users and the community at large. Assure the Customer - The Security Assurance Department The Security Assurance Department is comprised of the teams noted above. They target Customer Assurance projects among their responsibilities. This reflects the need for us to provide resources to our customers to assure them of the security and safety of GitLab as an application to use within their organisation and as a enterprise-level SaaS. This also involves providing appropriate support, services and resources to customers so that they trust GitLab as a Secure Company, as a Secure Product, and Secure SaaS Protect the Organization - Corporate Security GitLab is both a company and a product. The Corporate Security department focuses on implementing and protecting the information technology (IT) related systems that the company uses to conduct business internally, and provides the hardware, softw...",
    "hash": "7b6eab48b41e72bcca2f8e21ec349ec5"
  },
  {
    "url": "https://about.gitlab.com/direction/",
    "title": "GitLab Direction\n|\nGitLab",
    "content": "GitLab Direction Maintained by: David DeSanto @david Contribute to this page Edit this page You are here: GitLab Direction The following page may contain information related to upcoming products, features and functionality. It is important to note that the information presented is for informational purposes only, so please do not rely on the information for purchasing or planning purposes. Just like with all projects, the items mentioned on the page are subject to change or delay, and the development, release, and timing of any products, features or functionality remain at the sole discretion of GitLab Inc. On this page 3-year strategy Situation Strategic challenges Product Strategy Fiscal year product investment themes FY26 Key Principles Driving Themes R&D Investment Themes Win with DevSecOps platform completeness Differentiate with AI across the SDLC Lead with SDLC insights and reporting Elevate customer-centricity to customer obsession FY25 Key Principles Driving Themes R&D Investment Themes Enable AI/ML Efficiencies Across DevSecOps Drive Use Case Adoption to Fully Realize Value Differentiate on DevSecOps Platform Strengthen Our SaaS Deployments & Capabilities DevSecOps stages Your contributions Personas Mitigating low-end disruption Maturity Scope Quarterly Objectives and Key Results (OKRs) How we plan releases Previous releases Upcoming releases ML/AI at GitLab Cross-Stage efforts Footnotes 3-year strategy Situation GitLab competes in a large market space, with a CSM estimated at ~$18B in 2024. GitLab has recently surpassed the $150M ARR milestone, with unusually high revenue growth and retention rates. GitLab is uniquely positioned in the market with a vision to offer a single application for the entire DevSecOps lifecycle. GitLab competes across numerous market segments and aims to deliver value in 80+ market categories. GitLab’s product vision is uniquely ambitious, as we were the first DevSecOps player to take a single application approach. From idea to production, GitLab helps teams improve cycle time from weeks to minutes, reduce development process costs, and enable a faster time to market while increasing developer productivity. With software “eating the world,” this is widely viewed as a mission-critical value proposition for customers. We also have a number of tailwinds in the form of cloud adoption, Kubernetes adoption, and DevSecOps tool consolidation, which are helping fuel our rapid growth. Finally, GitLab has an open source community and distribution model, which has exposed the value of GitLab to millions of developers and has sped up the maturation of our product through more than 200 monthly improvements to the GitLab codebase from our users. Strategic challenges Tension between Breadth and Depth: Our ambitious single-application product vision means we need to build out feature function value across a very large surface area. With so much to deliver in a single application, it is a big UX challenge to keep the experience simple, consistent, and seamless between DevSecOps phases. Our challenge is to drive the right balance between breadth and depth by retaining a seed then nurture approach in new product areas while simultaneously improving existing product areas that generate usage and revenue. Shifting more focus to product depth will allow us to win and retain sophisticated enterprise customers. GitLab.com and Self-Managed: Another challenge we face is the balance between our self-managed and GitLab.com offerings. GitLab's early paying customers were more interested in self-managed, and the majority of our customers use this offering today. As a result, we focused heavily on delivering a great self-managed customer experience. However, as the market shifts toward cloud adoption, we are seeing an increasing demand for our GitLab.com offering. We now need to rapidly meet the same enterprise-grade security, reliability, and performance expectations our paying customers have come to expect from self-managed in our SaaS (.com offering). Wide Customer Profile: We also serve a wide range of customers, from individual contributor developers to large enterprises, across all vertical markets. This range of deployment options and customer sizes makes our business complex and makes it hard to optimize the customer experience for all customer sizes. Over the past few years, we have prioritized enabling our direct sales channel, but in the process have not focused enough on great customer experiences around self-service purchase workflows, onboarding, and cross-stage adoption. Competition: Finally, we have formidable competition from much larger companies, including Microsoft, Atlassian, and Synopsys to name a few. Microsoft is starting to mimic our single application positioning, and while behind us in the journey, have substantial resources to dedicate to competing with GitLab. Product Strategy Focus on increasing Stages per Organization (SpO): There is a strong correlation between the numbe...",
    "hash": "001295ac2b35e5747e42feda4de15249"
  },
  {
    "url": "https://about.gitlab.com/direction/#stategic-challenges",
    "title": "GitLab Direction\n|\nGitLab strategic challenges",
    "content": "GitLab Direction Maintained by: David DeSanto @david Contribute to this page Edit this page You are here: GitLab Direction The following page may contain information related to upcoming products, features and functionality. It is important to note that the information presented is for informational purposes only, so please do not rely on the information for purchasing or planning purposes. Just like with all projects, the items mentioned on the page are subject to change or delay, and the development, release, and timing of any products, features or functionality remain at the sole discretion of GitLab Inc. On this page 3-year strategy Situation Strategic challenges Product Strategy Fiscal year product investment themes FY26 Key Principles Driving Themes R&D Investment Themes Win with DevSecOps platform completeness Differentiate with AI across the SDLC Lead with SDLC insights and reporting Elevate customer-centricity to customer obsession FY25 Key Principles Driving Themes R&D Investment Themes Enable AI/ML Efficiencies Across DevSecOps Drive Use Case Adoption to Fully Realize Value Differentiate on DevSecOps Platform Strengthen Our SaaS Deployments & Capabilities DevSecOps stages Your contributions Personas Mitigating low-end disruption Maturity Scope Quarterly Objectives and Key Results (OKRs) How we plan releases Previous releases Upcoming releases ML/AI at GitLab Cross-Stage efforts Footnotes 3-year strategy Situation GitLab competes in a large market space, with a CSM estimated at ~$18B in 2024. GitLab has recently surpassed the $150M ARR milestone, with unusually high revenue growth and retention rates. GitLab is uniquely positioned in the market with a vision to offer a single application for the entire DevSecOps lifecycle. GitLab competes across numerous market segments and aims to deliver value in 80+ market categories. GitLab’s product vision is uniquely ambitious, as we were the first DevSecOps player to take a single application approach. From idea to production, GitLab helps teams improve cycle time from weeks to minutes, reduce development process costs, and enable a faster time to market while increasing developer productivity. With software “eating the world,” this is widely viewed as a mission-critical value proposition for customers. We also have a number of tailwinds in the form of cloud adoption, Kubernetes adoption, and DevSecOps tool consolidation, which are helping fuel our rapid growth. Finally, GitLab has an open source community and distribution model, which has exposed the value of GitLab to millions of developers and has sped up the maturation of our product through more than 200 monthly improvements to the GitLab codebase from our users. Strategic challenges Tension between Breadth and Depth: Our ambitious single-application product vision means we need to build out feature function value across a very large surface area. With so much to deliver in a single application, it is a big UX challenge to keep the experience simple, consistent, and seamless between DevSecOps phases. Our challenge is to drive the right balance between breadth and depth by retaining a seed then nurture approach in new product areas while simultaneously improving existing product areas that generate usage and revenue. Shifting more focus to product depth will allow us to win and retain sophisticated enterprise customers. GitLab.com and Self-Managed: Another challenge we face is the balance between our self-managed and GitLab.com offerings. GitLab's early paying customers were more interested in self-managed, and the majority of our customers use this offering today. As a result, we focused heavily on delivering a great self-managed customer experience. However, as the market shifts toward cloud adoption, we are seeing an increasing demand for our GitLab.com offering. We now need to rapidly meet the same enterprise-grade security, reliability, and performance expectations our paying customers have come to expect from self-managed in our SaaS (.com offering). Wide Customer Profile: We also serve a wide range of customers, from individual contributor developers to large enterprises, across all vertical markets. This range of deployment options and customer sizes makes our business complex and makes it hard to optimize the customer experience for all customer sizes. Over the past few years, we have prioritized enabling our direct sales channel, but in the process have not focused enough on great customer experiences around self-service purchase workflows, onboarding, and cross-stage adoption. Competition: Finally, we have formidable competition from much larger companies, including Microsoft, Atlassian, and Synopsys to name a few. Microsoft is starting to mimic our single application positioning, and while behind us in the journey, have substantial resources to dedicate to competing with GitLab. Product Strategy Focus on increasing Stages per Organization (SpO): There is a strong correlation between the numbe...",
    "hash": "001295ac2b35e5747e42feda4de15249"
  },
  {
    "url": "https://about.gitlab.com/direction/#product-strategy",
    "title": "GitLab Direction\n|\nGitLab product strategy",
    "content": "GitLab Direction Maintained by: David DeSanto @david Contribute to this page Edit this page You are here: GitLab Direction The following page may contain information related to upcoming products, features and functionality. It is important to note that the information presented is for informational purposes only, so please do not rely on the information for purchasing or planning purposes. Just like with all projects, the items mentioned on the page are subject to change or delay, and the development, release, and timing of any products, features or functionality remain at the sole discretion of GitLab Inc. On this page 3-year strategy Situation Strategic challenges Product Strategy Fiscal year product investment themes FY26 Key Principles Driving Themes R&D Investment Themes Win with DevSecOps platform completeness Differentiate with AI across the SDLC Lead with SDLC insights and reporting Elevate customer-centricity to customer obsession FY25 Key Principles Driving Themes R&D Investment Themes Enable AI/ML Efficiencies Across DevSecOps Drive Use Case Adoption to Fully Realize Value Differentiate on DevSecOps Platform Strengthen Our SaaS Deployments & Capabilities DevSecOps stages Your contributions Personas Mitigating low-end disruption Maturity Scope Quarterly Objectives and Key Results (OKRs) How we plan releases Previous releases Upcoming releases ML/AI at GitLab Cross-Stage efforts Footnotes 3-year strategy Situation GitLab competes in a large market space, with a CSM estimated at ~$18B in 2024. GitLab has recently surpassed the $150M ARR milestone, with unusually high revenue growth and retention rates. GitLab is uniquely positioned in the market with a vision to offer a single application for the entire DevSecOps lifecycle. GitLab competes across numerous market segments and aims to deliver value in 80+ market categories. GitLab’s product vision is uniquely ambitious, as we were the first DevSecOps player to take a single application approach. From idea to production, GitLab helps teams improve cycle time from weeks to minutes, reduce development process costs, and enable a faster time to market while increasing developer productivity. With software “eating the world,” this is widely viewed as a mission-critical value proposition for customers. We also have a number of tailwinds in the form of cloud adoption, Kubernetes adoption, and DevSecOps tool consolidation, which are helping fuel our rapid growth. Finally, GitLab has an open source community and distribution model, which has exposed the value of GitLab to millions of developers and has sped up the maturation of our product through more than 200 monthly improvements to the GitLab codebase from our users. Strategic challenges Tension between Breadth and Depth: Our ambitious single-application product vision means we need to build out feature function value across a very large surface area. With so much to deliver in a single application, it is a big UX challenge to keep the experience simple, consistent, and seamless between DevSecOps phases. Our challenge is to drive the right balance between breadth and depth by retaining a seed then nurture approach in new product areas while simultaneously improving existing product areas that generate usage and revenue. Shifting more focus to product depth will allow us to win and retain sophisticated enterprise customers. GitLab.com and Self-Managed: Another challenge we face is the balance between our self-managed and GitLab.com offerings. GitLab's early paying customers were more interested in self-managed, and the majority of our customers use this offering today. As a result, we focused heavily on delivering a great self-managed customer experience. However, as the market shifts toward cloud adoption, we are seeing an increasing demand for our GitLab.com offering. We now need to rapidly meet the same enterprise-grade security, reliability, and performance expectations our paying customers have come to expect from self-managed in our SaaS (.com offering). Wide Customer Profile: We also serve a wide range of customers, from individual contributor developers to large enterprises, across all vertical markets. This range of deployment options and customer sizes makes our business complex and makes it hard to optimize the customer experience for all customer sizes. Over the past few years, we have prioritized enabling our direct sales channel, but in the process have not focused enough on great customer experiences around self-service purchase workflows, onboarding, and cross-stage adoption. Competition: Finally, we have formidable competition from much larger companies, including Microsoft, Atlassian, and Synopsys to name a few. Microsoft is starting to mimic our single application positioning, and while behind us in the journey, have substantial resources to dedicate to competing with GitLab. Product Strategy Focus on increasing Stages per Organization (SpO): There is a strong correlation between the numbe...",
    "hash": "001295ac2b35e5747e42feda4de15249"
  },
  {
    "url": "https://about.gitlab.com/direction/#fy26",
    "title": "GitLab Direction\n|\nGitLab FY26",
    "content": "GitLab Direction Maintained by: David DeSanto @david Contribute to this page Edit this page You are here: GitLab Direction The following page may contain information related to upcoming products, features and functionality. It is important to note that the information presented is for informational purposes only, so please do not rely on the information for purchasing or planning purposes. Just like with all projects, the items mentioned on the page are subject to change or delay, and the development, release, and timing of any products, features or functionality remain at the sole discretion of GitLab Inc. On this page 3-year strategy Situation Strategic challenges Product Strategy Fiscal year product investment themes FY26 Key Principles Driving Themes R&D Investment Themes Win with DevSecOps platform completeness Differentiate with AI across the SDLC Lead with SDLC insights and reporting Elevate customer-centricity to customer obsession FY25 Key Principles Driving Themes R&D Investment Themes Enable AI/ML Efficiencies Across DevSecOps Drive Use Case Adoption to Fully Realize Value Differentiate on DevSecOps Platform Strengthen Our SaaS Deployments & Capabilities DevSecOps stages Your contributions Personas Mitigating low-end disruption Maturity Scope Quarterly Objectives and Key Results (OKRs) How we plan releases Previous releases Upcoming releases ML/AI at GitLab Cross-Stage efforts Footnotes 3-year strategy Situation GitLab competes in a large market space, with a CSM estimated at ~$18B in 2024. GitLab has recently surpassed the $150M ARR milestone, with unusually high revenue growth and retention rates. GitLab is uniquely positioned in the market with a vision to offer a single application for the entire DevSecOps lifecycle. GitLab competes across numerous market segments and aims to deliver value in 80+ market categories. GitLab’s product vision is uniquely ambitious, as we were the first DevSecOps player to take a single application approach. From idea to production, GitLab helps teams improve cycle time from weeks to minutes, reduce development process costs, and enable a faster time to market while increasing developer productivity. With software “eating the world,” this is widely viewed as a mission-critical value proposition for customers. We also have a number of tailwinds in the form of cloud adoption, Kubernetes adoption, and DevSecOps tool consolidation, which are helping fuel our rapid growth. Finally, GitLab has an open source community and distribution model, which has exposed the value of GitLab to millions of developers and has sped up the maturation of our product through more than 200 monthly improvements to the GitLab codebase from our users. Strategic challenges Tension between Breadth and Depth: Our ambitious single-application product vision means we need to build out feature function value across a very large surface area. With so much to deliver in a single application, it is a big UX challenge to keep the experience simple, consistent, and seamless between DevSecOps phases. Our challenge is to drive the right balance between breadth and depth by retaining a seed then nurture approach in new product areas while simultaneously improving existing product areas that generate usage and revenue. Shifting more focus to product depth will allow us to win and retain sophisticated enterprise customers. GitLab.com and Self-Managed: Another challenge we face is the balance between our self-managed and GitLab.com offerings. GitLab's early paying customers were more interested in self-managed, and the majority of our customers use this offering today. As a result, we focused heavily on delivering a great self-managed customer experience. However, as the market shifts toward cloud adoption, we are seeing an increasing demand for our GitLab.com offering. We now need to rapidly meet the same enterprise-grade security, reliability, and performance expectations our paying customers have come to expect from self-managed in our SaaS (.com offering). Wide Customer Profile: We also serve a wide range of customers, from individual contributor developers to large enterprises, across all vertical markets. This range of deployment options and customer sizes makes our business complex and makes it hard to optimize the customer experience for all customer sizes. Over the past few years, we have prioritized enabling our direct sales channel, but in the process have not focused enough on great customer experiences around self-service purchase workflows, onboarding, and cross-stage adoption. Competition: Finally, we have formidable competition from much larger companies, including Microsoft, Atlassian, and Synopsys to name a few. Microsoft is starting to mimic our single application positioning, and while behind us in the journey, have substantial resources to dedicate to competing with GitLab. Product Strategy Focus on increasing Stages per Organization (SpO): There is a strong correlation between the numbe...",
    "hash": "001295ac2b35e5747e42feda4de15249"
  },
  {
    "url": "https://about.gitlab.com/direction/#fy25",
    "title": "GitLab Direction\n|\nGitLab FY25",
    "content": "GitLab Direction Maintained by: David DeSanto @david Contribute to this page Edit this page You are here: GitLab Direction The following page may contain information related to upcoming products, features and functionality. It is important to note that the information presented is for informational purposes only, so please do not rely on the information for purchasing or planning purposes. Just like with all projects, the items mentioned on the page are subject to change or delay, and the development, release, and timing of any products, features or functionality remain at the sole discretion of GitLab Inc. On this page 3-year strategy Situation Strategic challenges Product Strategy Fiscal year product investment themes FY26 Key Principles Driving Themes R&D Investment Themes Win with DevSecOps platform completeness Differentiate with AI across the SDLC Lead with SDLC insights and reporting Elevate customer-centricity to customer obsession FY25 Key Principles Driving Themes R&D Investment Themes Enable AI/ML Efficiencies Across DevSecOps Drive Use Case Adoption to Fully Realize Value Differentiate on DevSecOps Platform Strengthen Our SaaS Deployments & Capabilities DevSecOps stages Your contributions Personas Mitigating low-end disruption Maturity Scope Quarterly Objectives and Key Results (OKRs) How we plan releases Previous releases Upcoming releases ML/AI at GitLab Cross-Stage efforts Footnotes 3-year strategy Situation GitLab competes in a large market space, with a CSM estimated at ~$18B in 2024. GitLab has recently surpassed the $150M ARR milestone, with unusually high revenue growth and retention rates. GitLab is uniquely positioned in the market with a vision to offer a single application for the entire DevSecOps lifecycle. GitLab competes across numerous market segments and aims to deliver value in 80+ market categories. GitLab’s product vision is uniquely ambitious, as we were the first DevSecOps player to take a single application approach. From idea to production, GitLab helps teams improve cycle time from weeks to minutes, reduce development process costs, and enable a faster time to market while increasing developer productivity. With software “eating the world,” this is widely viewed as a mission-critical value proposition for customers. We also have a number of tailwinds in the form of cloud adoption, Kubernetes adoption, and DevSecOps tool consolidation, which are helping fuel our rapid growth. Finally, GitLab has an open source community and distribution model, which has exposed the value of GitLab to millions of developers and has sped up the maturation of our product through more than 200 monthly improvements to the GitLab codebase from our users. Strategic challenges Tension between Breadth and Depth: Our ambitious single-application product vision means we need to build out feature function value across a very large surface area. With so much to deliver in a single application, it is a big UX challenge to keep the experience simple, consistent, and seamless between DevSecOps phases. Our challenge is to drive the right balance between breadth and depth by retaining a seed then nurture approach in new product areas while simultaneously improving existing product areas that generate usage and revenue. Shifting more focus to product depth will allow us to win and retain sophisticated enterprise customers. GitLab.com and Self-Managed: Another challenge we face is the balance between our self-managed and GitLab.com offerings. GitLab's early paying customers were more interested in self-managed, and the majority of our customers use this offering today. As a result, we focused heavily on delivering a great self-managed customer experience. However, as the market shifts toward cloud adoption, we are seeing an increasing demand for our GitLab.com offering. We now need to rapidly meet the same enterprise-grade security, reliability, and performance expectations our paying customers have come to expect from self-managed in our SaaS (.com offering). Wide Customer Profile: We also serve a wide range of customers, from individual contributor developers to large enterprises, across all vertical markets. This range of deployment options and customer sizes makes our business complex and makes it hard to optimize the customer experience for all customer sizes. Over the past few years, we have prioritized enabling our direct sales channel, but in the process have not focused enough on great customer experiences around self-service purchase workflows, onboarding, and cross-stage adoption. Competition: Finally, we have formidable competition from much larger companies, including Microsoft, Atlassian, and Synopsys to name a few. Microsoft is starting to mimic our single application positioning, and while behind us in the journey, have substantial resources to dedicate to competing with GitLab. Product Strategy Focus on increasing Stages per Organization (SpO): There is a strong correlation between the numbe...",
    "hash": "001295ac2b35e5747e42feda4de15249"
  }
]